const solution = require('./1');

// Test case 1 (Пример 1)
solution({
    graph: {
        "Александра": ["Борис"],
        "Борис": ["Александра", "Светлана"],
        "Светлана": ["Борис"]
    },
    startVertex: "Александра",
    endVertex: "Светлана"
});

solution({
    graph: {},
    startVertex: "Александра",
    endVertex: "Светлана"
});
// Expected output: 2 (distance from Александра to Светлана)

// Test case 2 (Пример 2)
solution({
    graph: {
        "Артемий": ["Бронислав", "Дементий"],
        "Бронислав": ["Артемий", "Софья",],
        "Софья": ["Гаврила"],
        "Дементий": ["Фаина", "Бронислав"],
        "Фаина": ["Гаврила"],
        "Гаврила": ["Фаина"]
    },
    startVertex: "Артемий",
    endVertex: "Артемий",
});